#include "butterfly.h"

// Each layer gets a name for readability, which is then used in the keymap matrix below.
// The underscores don't mean anything - you can have a layer called STUFF or any other name.
// Layer names don't all need to be of the same length, obviously, and you can also skip them
// entirely and just use numbers.

// Fillers to make layering more clear
#define _______ KC_TRNS
#define XXXXXXX KC_NO
#define QWERTY 0
#define LOWER 1
#define RAISE 2
#define FUNCTION 3

const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {

/* Qwerty 
*  ,-----------------------------------------.             ,-----------------------------------------.
 * | Tab  |   1  |   2  |   3  |   4  |   5  |             |   6  |   7  |   8  |   9  |   0  | Del  |
 * |-----------------------------------------|             |-----------------------------------------|
 * | Esc  |   Q  |   W  |   E  |   R  |   T  |             |   Y  |   U  |   I  |   O  |   P  |  '   |
 * |------+------+------+------+------+------|             |------+------+------+------+------+------|
 * | Ctrl |   A  |   S  |   D  |   F  |   G  |             |   H  |   J  |   K  |   L  |   ;  |Enter |
 * '------+------+------+------+------+------|             |------+------+------+------+------+------'
 *        |   Z  |   X  |   C  |   V  |   B  |             |   N  |   M  |   ,  |   .  |   /  |
 *        '------+------+------+------+------+------+------+------+------+------+------+------'
 *                      | alt  | super|space | bksp |Raise | shift|  alt | fn   |
 *                      `-------------------------------------------------------'
 */
[QWERTY] = {
  {KC_TAB,  KC_1,    KC_2,    KC_3,    KC_4,    KC_5,    KC_6,    KC_7,    KC_8,    KC_9,    KC_0,   XXXXXXX},
  {KC_ESC,  KC_Q,    KC_W,    KC_E,    KC_R,    KC_T,    KC_Y,    KC_U,    KC_I,    KC_O,    KC_P,    KC_DEL},
  {KC_LCTRL,  KC_A,    KC_S,    KC_D,    KC_F,    KC_G,    KC_H,    KC_J,    KC_K,    KC_L,    KC_SCLN, KC_QUOT},
  {XXXXXXX, KC_Z,    KC_X,    KC_C,    KC_V,    KC_B,    KC_N,    KC_M,    KC_COMM, KC_DOT,  KC_SLSH,  KC_ENT},
  {XXXXXXX, XXXXXXX, KC_LALT, KC_LGUI, KC_SPC ,   KC_BSPC ,  MO(RAISE),   KC_LSHIFT, KC_RALT, MO(QWERTY), XXXXXXX, XXXXXXX}
},/*
//LT(FUNCTION, KC_MPLY) // play-payse/function
*  ,-----------------------------------------.             ,-----------------------------------------.
 * | Tab  |   1  |   2  |   3  |   4  |   5  |             |   6  |   7  |   8  |   9  |   0  | Bksp |
 * |-----------------------------------------|             |-----------------------------------------|
 * | Esc  |   Q  |   W  |   E  |   R  |   T  |             |   Y  |   U  |   I  |   O  |   P  |  '   |
 * |------+------+------+------+------+------|             |------+------+------+------+------+------|
 * | Ctrl |   A  |   S  |   D  |   F  |   G  |             |   H  |   J  |   K  |   L  |   ;  |Enter |
 * '------+------+------+------+------+------|             |------+------+------+------+------+------'
 *        |   Z  |   X  |   C  |   V  |   B  |             |   N  |   M  |   ,  |   .  |   /  |
 *        '------+------+------+------+------+------+------+------+------+------+------+------'
 *                      | alt  | super|space | Space|Raise | shift|  alt | fn   |
 *                      `-------------------------------------------------------'
 *
[LOWER] = {
  {_______,   _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______}
  {KC_TILD,   KC_EXLM,   KC_AT, KC_HASH,  KC_DLR, KC_PERC, KC_CIRC, KC_AMPR, KC_ASTR, KC_LPRN, KC_RPRN, KC_BSPC},
  {_______,   _______, KC_LCBR, KC_RCBR, KC_PLUS, _______, _______,RALT(KC_W), RALT(KC_Q), RALT(KC_P), KC_UNDS, _______},
  {_______, _______,   _______,   _______,   _______,  _______,  _______,_______, _______,_______, KC_BSLS, _______},
  {_______,   _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______}
},

* Raise

*  ,-----------------------------------------.             ,-----------------------------------------.
 * |  Tab |   !  |   @  |   #  |   $  |   %  |             |   ^  |   &  |   *  |   (  |   )  | del  |
 * |-----------------------------------------|             |-----------------------------------------|
 * | Esc  |   ~  |   {  |   }  |   +  |   T  |             |   Y  |   Å  |   Ä  |   Ö  |   _  |  '   |
 * |------+------+------+------+------+------|             |------+------+------+------+------+------|
 * | Ctrl |   `  |   [  |   ]  |   =  |   G  |             | left | down |  up  | right|   -  |Enter |
 * '------+------+------+------+------+------|             |------+------+------+------+------+------'
 *        |   Z  |   X  |   C  |   V  |   B  |             |   N  |   |  |   ,  |   .  |   \  |
 *        '------+------+------+------+------+------+------+------+------+------+------+------'
 *                      | lalt | super|space | bksp |Raise | shift| ralt | fn   |
 *                      `-------------------------------------------------------'
 */
[RAISE] = {
  {_______, KC_EXLM,   KC_AT, KC_HASH,   KC_DLR, KC_PERC, KC_CIRC,  KC_AMPR, KC_ASTR, KC_LPRN, KC_RPRN, _______},
  {_______, KC_TILD, KC_LCBR, KC_RCBR,  KC_PLUS, _______, _______, RALT(KC_W), RALT(KC_Q), RALT(KC_P), KC_UNDS, _______},
  {_______,  KC_GRV, KC_LBRC, KC_RBRC,   KC_EQL, _______, KC_LEFT,  KC_DOWN,  KC_UP, KC_RIGHT, KC_MINS, _______},
  {_______, _______, _______, _______,  _______, _______,    KC_N,  KC_PIPE, _______, _______, KC_BSLS, _______},
  {_______, _______, _______, _______, _______ , _______, _______,  _______, _______, _______, _______, _______}
}

/* Fn
*  ,-----------------------------------------.             ,-----------------------------------------.
 * | Tab  |   1  |   2  |   3  |   4  |   5  |             |   6  |   7  |   8  |   9  |   0  | Bksp |
 * |-----------------------------------------|             |-----------------------------------------|
 * | Esc  |   Q  |   W  |   E  |   R  |   T  |             |   Y  |   U  |   I  |   O  |   P  |  '   |
 * |------+------+------+------+------+------|             |------+------+------+------+------+------|
 * | Ctrl |   A  |   S  |   D  |   F  |   G  |             |   H  |   J  |   K  |   L  |   ;  |Enter |
 * '------+------+------+------+------+------|             |------+------+------+------+------+------'
 *        |   Z  |   X  |   C  |   V  |   B  |             |   N  |   M  |   ,  |   .  |   /  |
 *        '------+------+------+------+------+------+------+------+------+------+------+------'
 *                      | alt  | super|space | Space|Raise | shift|  alt | fn   |
 *                      `-------------------------------------------------------'
 *
[FUNCTION] = {
  {KC_F1,  KC_F2,    KC_F3,    KC_F4,    KC_F5,    KC_F6,    KC_F7,    KC_F8,    KC_F9,    KC_F10,    KC_F11,    KC_F12},
  {_______, _______,   _______,   _______,   _______,  _______,  KC_MEDIA_PREV_TRACK,  KC_AUDIO_VOL_DOWN, KC_AUDIO_VOL_UP, KC_MEDIA_NEXT_TRACK, _______, _______},
  {_______,   _______, _______, _______, _______, _______, _______, KC_AUDIO_MUTE, _______, _______, _______, _______},
  {_______,  _______,   _______,   _______,   KC_CAPS,   _______,   _______,   _______, _______,  _______, _______, _______}
},
*/
};

const uint16_t PROGMEM fn_actions[] = {

};

const macro_t *action_get_macro(keyrecord_t *record, uint8_t id, uint8_t opt)
{
  return MACRO_NONE;
};
